/*

    알고리즘을 푸는데있어서 번뜩이는 영감보다는 이미 알고있는 알고리즘 종류로 동치화해서 푸는게 훨씬 더 많다.
    때문에 우리는 알고리즘 종류(페러다임)들을 배워야한다.

    무식하게 풀기
    1. 재귀호출과 완전탐색 방법
        1. 생각보다 컴퓨터는 엄청 빠르기 때문에 반복문사이클이 1억사이클이 넘지 않은 이상은 완전탐색풀이로 푸는게 
        가장 직관적이고 쉽다. 
        2. 그 완전탐색을 위해서 재귀호출함수가 굉장히 잘 쓰인다. 
        3. 재귀호출은 반복문을 사용하는 대신에, 자기 자신을 계속 더 호출하는 방식으로 반복문을 대체한다. 
        4. 재귀함수를 잘 만드는 방법을 더 알아보자 (매우 중요) 
            1. 반복되는 현상을 찾는다. 
            2. 그 반복되는 현상을 더 작은 반복현상으로 나눌수있는지 생각한다. 
            3. 가장 최소의 반복싸이클 현상을 찾고 답이 나왔을 때를 가정한 기저사례를 생각한다. 
            4. 반복되는 사례를 통해서 더이상 반복할 거리가 없을 때가 기저사례조건이다. 
            5. 또한 기저사례때 재귀호출을 당장 종료하면서 그 순간이 답이 도출되는 시점이다. 
            6. 이 재귀함수를 잘 작성하는 방법은 문제를 수많은 부분문제로 나누는 능력이다. 
            7. 이능력은 분할 계획법이랑 동적 계획법에도중요한 능력이다. 
            8. 따라서 문제를 잘 파악하고 형식은 같지만, 다른 문제인 수많은 작은 부분문제로 나누는 연습을 해야한다. 
             
    분할 정복
    1. 

    동적 계획법
    1. 

    동적 계회법 테크닉 
    1. 


    탐욕법
    1. 


    

*/