/*
    알고리즘 분석

    <알고리즘이란?>
    1. 주관적이거나 모호한 것은 알고리즘이 아니다.
    2. 가능한 명료하고 모호하지 않아야 한다.
    3. 그렇다고 알고리즘 === 코드는 아니다. 
    4. 알고리즘은 문제를 해결하는 방법 그 자체이다.
    5. 따라서 같은 문제를 해결하는데 여러가지 알고리즘이 있을 수 있고, 우리는 그래서..어떤게 가장 좋은 알고리즘인지 분석해서 파악해야한다.


    <알고리즘 평가>
    1. 평가의 기준이 되는 것은 "시간"과 "메모리 공간" 그리고 "정당성" 이다.
        1. 시간
            1. 여러 알고리즘의 수행 속도와 특성을 분석하는 능력을 키워야 한다.
        2. 공간
            1. 더 적은 용량을 사용하수록 좋다. 특히 알고리즘 문제에는 제한된 메모리가 주어진다.
        3. 정당성
            1. 어떤 알고리즘이 목적 해결에 도달할 수 있는 알고리즘인지 아니지의 유무이다.
            2. 매우 기본적으로, 틀린 답을 도출하는 알고리즘은 속도와 공간을 따지기 이전에, 이미 틀린 답이다.
    2. 이 두 기준 시간과 공간은 서로 상충하는 경우가 많다.
        1. 메모리 사용량을 늘리면 속도가 빨라지고
            1. 특히 요즘은 메모리가 여유로워졌기 때문에 많은 메모리를 사용하여 속도를 높이는 알고리즘이 더 중요하고
            대표적으로 동적 계획법이 있다.
        2. 속도를 희생해서 메모리 사용량을 줄일 수 있다. 


    3. 앞으로 우리는 속도와 정당성을 증명하는 기술들에 집중할 것이다. 이 두 가지가 가장 중요하기 때문이다.


    <알고리즘의 시간 복잡도 분석>
    
    





*/

